23.	Perform following operations on the given data set (Toyota.csv)
a.	Remove duplicate records from dataset and display concise summary
b.	Create Subset selecting columns 'Price', 'Age', 'FuelType' and initial 10 records.
c.	Transpose of this subset
d.	Apply mean-max normalization on HP column

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Toyota.csv")

In [8]:
df.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170

# a. Remove duplicate records and display concise summary

In [10]:
df = df.drop_duplicates()
print("\nSummary After Removing Duplicates:")
print(df.info())

Summary After Removing Duplicates:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1436 non-null   int64
 1   Price       1436 non-null   int64
 2   Age         1336 non-null   float64
 3   KM          1436 non-null   object
 4   FuelType    1336 non-null   object
 5   HP          1436 non-null   object
 6   MetColor    1286 non-null   float64
 7   Automatic   1436 non-null   int64
 8   CC          1436 non-null   int64
 9   Doors       1436 non-null   object
 10  Weight      1436 non-null   int64
dtypes: float64(2), int64(5), object(4)
memory usage: 123.5+ KB
None

# b. Create subset with columns 'Price', 'Age', 'FuelType' and first 10 records

In [13]:
subset = df[['Price', 'Age', 'FuelType']].head(10)
print("\nSubset (first 10 rows):\n", subset)

Subset (first 10 rows):
    Price   Age FuelType
0  13500  23.0   Diesel
1  13750  23.0   Diesel
2  13950  24.0   Diesel
3  14950  26.0   Diesel
4  13750  30.0   Diesel
5  12950  32.0   Diesel
6  16900  27.0   Diesel
7  18600  30.0      NaN
8  21500  27.0   Petrol
9  12950  23.0   Diesel

# c. Transpose of this subset

In [16]:
transposed = subset.transpose()
transposed

,0,1,2,3,4,5,6,7,8,9
Price,13500,13750,13950,14950,13750,12950,16900,18600,21500,12950
Age,23.0,23.0,24.0,26.0,30.0,32.0,27.0,30.0,27.0,23.0
FuelType,Diesel,Diesel,Diesel,Diesel,Diesel,Diesel,Diesel,NaN,Petrol,Diesel

# d. Apply Mean-Max Normalization on HP column

In [19]:
# Formula: (x - mean) / (max - min)

In [20]:
df['HP'] = pd.to_numeric(df['HP'], errors='coerce')

In [21]:
mean_hp = df['HP'].mean()
max_hp = df['HP'].max()
min_hp = df['HP'].min()

In [22]:
df['HP_mean_max_normalized'] = (df['HP'] - mean_hp) / (max_hp - min_hp)
print("\nSample of HP after Mean-Max Normalization:\n", df[['HP', 'HP_mean_max_normalized']].head())

Sample of HP after Mean-Max Normalization:
      HP  HP_mean_max_normalized
0  90.0                -0.09332
1  90.0                -0.09332
2  90.0                -0.09332
3  90.0                -0.09332
4  90.0                -0.09332